#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//	Сообщить(Проведен);
	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ВКМ_ВыплатаЗарплаты.Ссылка КАК Ссылка
//		|ИЗ
//		|	Документ.ВКМ_ВыплатаЗарплаты КАК ВКМ_ВыплатаЗарплаты
//		|ГДЕ
//		|	ВКМ_ВыплатаЗарплаты.Проведен
//		|	И МЕСЯЦ(ВКМ_ВыплатаЗарплаты.Дата) = МЕСЯЦ(&Период)";
//	
//	Запрос.УстановитьПараметр("Период", Дата);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	ыы = Выборка.Следующий();
//	
//	Сообщить("!");
//	
//	Если Не Запрос.Выполнить().Пустой() Тогда
//		Сообщение = Новый СообщениеПользователю();
//		Сообщение.Текст = 
//			СтрШаблон("Документ на выплату зарплаты за месяц %1 уже есть!",  Формат(Дата,"ДФ=ММММ;"));
//		Сообщение.Сообщить();
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;
		
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого СтрокаТЧ из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
	КонецЦикла;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ВыплатаЗарплаты.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВКМ_ВыплатаЗарплаты КАК ВКМ_ВыплатаЗарплаты
			|ГДЕ
			|	ВКМ_ВыплатаЗарплаты.Проведен
			|	И МЕСЯЦ(ВКМ_ВыплатаЗарплаты.Дата) = МЕСЯЦ(&Период)";
		
		Запрос.УстановитьПараметр("Период", Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если Ссылка <> Выборка.Ссылка Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = 
					СтрШаблон("Документ на выплату зарплаты за месяц %1 уже есть!",  Формат(Дата,"ДФ=ММММ;"));
				Сообщение.Сообщить();
				Отказ = Истина;				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#КонецЕсли