#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_НачалоДоговора,
		|	ДоговорыКонтрагентов.ВКМ_КонецДоговора,
		|	ДоговорыКонтрагентов.ВКМ_Почасовка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не найден договор!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходим действующий договор абонентского обслуживания!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если ДатаРабот < Выборка.ВКМ_НачалоДоговора ИЛИ ДатаРабот > Выборка.ВКМ_КонецДоговора Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "На указанную дату нет действующего договора абонентского обслуживания!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
	ПроцентСотрудника = ПроцентСотрудника();
	Если ПроцентСотрудника = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Указанному сотруднику не определен процент за работы!";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;		
	КонецЕсли;	
	
	
	КоличествоЧасов = ТЧВыполненныеРаботы.Итог("ЧасыКОплате");
	СуммаКОплатеКлиенту = Выборка.ВКМ_Почасовка * КоличествоЧасов;
	СуммаКОплатеСпецу = СуммаКОплатеКлиенту * ПроцентСотрудника;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
	Движение.Период = ДатаРабот;
	Движение.Договор = Договор;
	Движение.Клиент = Клиент;
	Движение.КоличествоЧасов = КоличествоЧасов;
	Движение.СуммаКОплате = СуммаКОплатеКлиенту;
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.ДобавитьПриход();
	Движение.Период = ДатаРабот;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = КоличествоЧасов;
	Движение.СуммаКОплате = СуммаКОплатеСпецу;	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 

	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ТекстСообщения = СтрШаблон("Новая заявка на обслуживание №%1 от %2!", Номер, Дата);
	Иначе 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаРабот,
		|	ВКМ_ОбслуживаниеКлиента.Начало
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 

		Запрос.УстановитьПараметр("Ссылка", Ссылка); 

		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			Если Специалист <> Выборка.Специалист Тогда;
				ТекстСообщения = СтрШаблон("Заявка №%1 от %2. Специалист - %3!", 
					Номер, Формат(Дата, "ДФ=dd.MM.yy;"), Специалист); 
			ИначеЕсли ДатаРабот <> Выборка.ДатаРабот Или Начало <> Выборка.Начало Тогда
				ТекстСообщения = СтрШаблон("Заявка №%1 от %2. Время работ изменилось на %3 с %4!", 
					Номер, Формат(Дата, "ДФ=dd.MM.yy;"), Формат(ДатаРабот, "ДФ=dd.MM.yy;"), 
					Формат(Начало, "ДФ=чч.мм;"));				
			Иначе
				ТекстСообщения = СтрШаблон("Возможное изменение заявки №%1 от %2!", 
					Номер, Формат(Дата, "ДФ=dd.MM.yy;")); 
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	 
	ЗаписьВСправочник = Справочники.ВКМ_УведомленияТелеБоту.СоздатьЭлемент();
	ЗаписьВСправочник.ТекстСообщения = ТекстСообщения;
	ЗаписьВСправочник.Записать();

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроцентСотрудника()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтРабот
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли