#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций

Процедура ОбработкаПроведения(Отказ,Режим)

	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Сообщить("Необходим действующий договор абонентского обслуживания!");
		Возврат;
	КонецЕсли;
	Если ДатаРабот < Договор.ВКМ_НачалоДоговора ИЛИ ДатаРабот > Договор.ВКМ_КонецДоговора Тогда
		Сообщить("На указанную дату нет действующего договора абонентского обслуживания!");
		Возврат;		
	КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;

	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = ДатаРабот;
	Движение.Договор = Договор;
	Движение.Клиент = Клиент;
	Движение.КоличествоЧасов = ТЧВыполненныеРаботы.Итог("ЧасыКОплате");
	Движение.СуммаКОплате = Договор.ВКМ_Почасовка * ТЧВыполненныеРаботы.Итог("ЧасыКОплате");

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 

	Если ЭтоНовый() Тогда
		ТекстСообщения = СтрШаблон("Новая заявка на обслуживание №%1 от %2!", Номер, Дата);
	Иначе 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаРабот,
		|	ВКМ_ОбслуживаниеКлиента.Начало
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 

		Запрос.УстановитьПараметр("Ссылка", Ссылка); 

		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			Если Специалист <> Выборка.Специалист Тогда;
				ТекстСообщения = СтрШаблон("Заявка №%1 от %2. Специалист - %3!", 
					Номер, Формат(Дата, "ДФ=dd.MM.yy;"), Специалист); 
			ИначеЕсли ДатаРабот <> Выборка.ДатаРабот Или Начало <> Выборка.Начало Тогда
				ТекстСообщения = СтрШаблон("Заявка №%1 от %2. Время работ изменилось на %3 с %4!", 
					Номер, Формат(Дата, "ДФ=dd.MM.yy;"), Формат(ДатаРабот, "ДФ=dd.MM.yy;"), 
					Формат(Начало, "ДФ=чч.мм;"));				
			Иначе
				ТекстСообщения = СтрШаблон("Возможное изменение заявки №%1 от %2!", 
					Номер, Формат(Дата, "ДФ=dd.MM.yy;")); 
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	 
	ЗаписьВСправочник = Справочники.ВКМ_УведомленияТелеБоту.СоздатьЭлемент();
	ЗаписьВСправочник.ТекстСообщения = ТекстСообщения;
	ЗаписьВСправочник.Записать();

КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти