
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

//	++ВКМ Добавление подсистемы печати 

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктУслуги";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 5;
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктУслуги");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАктаУслуги(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "ОбщийМакет.ПФ_MXL_ВКМ_АктУслуги";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции 

Функция ПечатьАктаУслуги(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктУслуги";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ВКМ_АктУслуги");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;

	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиАктУслуги(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);
		
	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Организация.Представление КАК Исполнитель,
	|	РеализацияТоваровУслуг.Контрагент.Представление КАК Заказчик,
	|	РеализацияТоваровУслуг.Договор.Представление КАК Основание,
	|	РеализацияТоваровУслуг.Услуги.(
	|		НомерСтроки КАК НСтр,
	|		Номенклатура.Представление КАК Наименование,
	|		Количество,
	|		Сумма)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ВывестиАктУслуги(ДанныеДокументов, ТабличныйДокумент, Макет)

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ДанныеПечати = ЗаполнитьЗаголовок(ДанныеДокументов);
	ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ТабличныйДокумент.Вывести(ОбластьШапкаТЧ);	
	
	ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	Итого = 0;
	ДанныеТЧ = ДанныеДокументов.Услуги.Выбрать();
	Пока ДанныеТЧ.Следующий() Цикл
		Итого = Итого + ДанныеТЧ.Сумма;
		ОбластьСтрокаТЧ.Параметры.Заполнить(ДанныеТЧ);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТЧ);
	КонецЦикла;	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Итого", Итого);
	ДанныеПечати.Вставить("Всего", Итого);
	ДанныеПечати.Вставить("СуммаПрописью", 
		ЧислоПрописью(Итого, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПечати);	
	ТабличныйДокумент.Вывести(ОбластьПодвал);	
	
КонецПроцедуры

Функция ЗаполнитьЗаголовок(ДанныеДокументов)
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Номер", ДанныеДокументов.Номер);
	ДанныеПечати.Вставить("Дата", Формат(ДанныеДокументов.Дата,"ДФ=dd.MM.yyyy;"));
	ДанныеПечати.Вставить("Исполнитель", ДанныеДокументов.Исполнитель);
	ДанныеПечати.Вставить("Заказчик", ДанныеДокументов.Заказчик);
	ДанныеПечати.Вставить("Основание", ДанныеДокументов.Основание);
	Возврат ДанныеПечати;
КонецФункции

//	--ВКМ Добавление подсистемы печати

#КонецОбласти

#КонецЕсли