
#Область ПрограммныйИнтерфейс

//Процедура ПроверитьИзмененияЗаявок1() Экспорт
//	Сообщение = Новый СообщениеПользователю();
//	Сообщение.Текст = "Задание";
//КонецПроцедуры

//	Проверяет справочник ВКМ_УведомленияТелеБоту на наличие записей.
//	При наличии - отправляет сообщение в группу Telegram.
Процедура ПроверитьИзмененияЗаявок() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ВКМ_УведомленияТелеБоту.ТекстСообщения,
        |	ВКМ_УведомленияТелеБоту.Ссылка
        |ИЗ
        |	Справочник.ВКМ_УведомленияТелеБоту КАК ВКМ_УведомленияТелеБоту";
 
    Выборка = Запрос.Выполнить().Выбрать();
 
    Пока Выборка.Следующий() Цикл
        Если ОтправитьВТелеграм(Выборка.ТекстСообщения) Тогда
        	ЗаписьСправочника = Выборка.Ссылка.ПолучитьОбъект();
        	ЗаписьСправочника.Удалить();
        Иначе
        	Сообщение = Новый СообщениеПользователю();
        	Сообщение.Текст = "Проверьте журнал регистрации!";
        	Сообщение.Сообщить();
        КонецЕсли;
    КонецЦикла;	
КонецПроцедуры

//	Функция отправки сообщений в Telegram
//	Параметры:
//		Сообщение - Строка - сообщение для отправки в группу
//	Возвращаемое значение:
//		Булево - Истина - Сообщение отправлено
//				 Ложь - Ошибка в журнале регистрации
Функция ОтправитьВТелеграм(Сообщение) Экспорт

	ТокенБота = Константы.ВКМ_ТелеБотТокен.Получить();
	ИдентификаторЧата = Константы.ВКМ_ИДГруппы.Получить();
	
	Данные = Новый Структура;
	Данные.Вставить("chat_id", ИдентификаторЧата);
	Данные.Вставить("text", Сообщение);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , 5, Новый ЗащищенноеСоединениеOpenSSL());

	URL = СтрШаблон("bot%1/SendMessage", ТокенБота);
	
	Запрос = Новый HTTPЗапрос(URL);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, "utf-8");
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Истина;
	Иначе
		ИмяСобытия = "Отправка сообщени в ТелеграмБот";
		Уровень = УровеньЖурналаРегистрации.Ошибка;
		Описание = СтрШаблон("Не отправлено сообщение - %1.%2%3.", 
			Сообщение, Символы.ПС, Ответ.ПолучитьТелоКакСтроку()); 
		ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, , , Описание);	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

#КонецОбласти

