#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	
	ЧислоСекундВСутках = 86400;
	Дат = ДатаНачала;
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) = 0 Тогда
			Запись.Значение = 1;
		Иначе	          
			Запись.Значение = 0;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла;
	 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли