#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПересчитатьДни();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)

	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Сотрудник) Или Не ЗначениеЗаполнено(ТекДанные.ДатаНачала) 
			Или Не ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	Если (ТекДанные.ДатаНачала >= ТекДанные.ДатаОкончания) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Проверьте даты начала и конца отпуска!";
		Сообщение.Сообщить();
		Возврат
	КонецЕсли;
	ТекДанные.ДнейОтпуска =  1 + (НачалоДня(ТекДанные.ДатаОкончания) - НачалоДня(ТекДанные.ДатаНачала)) / (60 * 60 * 24);
	ПересчитатьДни();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафиков(Команда)
	ПутьКДанным = ВыгрузитьДанные();
	ПараметрыФормы = Новый Структура("ПутьКДанным", ПутьКДанным);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьДанные()
	
	ДанныеДляАнализа = Объект.ОтпускаСотрудников.Выгрузить(, "Сотрудник, ДатаНачала, ДатаОкончания");
	ДанныеДляАнализа.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	Сотрудники = ДанныеДляАнализа.ВыгрузитьКолонку("Сотрудник");
	ТСотрудники = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники, "Наименование");
	Для Каждого ТабСтр Из ДанныеДляАнализа Цикл
		ТабСтр.Наименование = ТСотрудники.Получить(ТабСтр.Сотрудник);
	КонецЦикла;
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляАнализа, Новый УникальныйИдентификатор)
	
КонецФункции

&НаСервере
Процедура ПересчитатьДни()

	Таб = Объект.ОтпускаСотрудников.Выгрузить();
	Таб.Свернуть("Сотрудник", "ДнейОтпуска");
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		СтрокаТЗ = Таб.Найти(Строка.Сотрудник, "Сотрудник");
		Строка.ВсегоОтпуск = СтрокаТЗ.ДнейОтпуска
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
