#Если Сервер Тогда

#Область ПрограммныйИнтерфейс

// Создает и заполняет документ РеализацияТоваровУслуг
//
// Параметры:
//   Период - Дата - дата создания документов.
//
// Возвращаемое значение:
//   Число - количество обработанных договоров.
Функция СоздатьРеализацииВдолгую(Период) Экспорт
	
	Выборка = СобратьРеализации(Период);
	
	Всего = Выборка.Количество();
	Счетчик = 0;
	Новых = 0;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			Реализация.Дата = Период;
			Реализация.Организация = Выборка.Организация;
			Реализация.Контрагент = Выборка.Контрагент;
			Реализация.Договор = Выборка.Договор;
			Новых = Новых + 1;		
		Иначе
			Реализация = Выборка.Реализация.ПолучитьОбъект();
		КонецЕсли;
		Реализация.Заполнить(Реализация);
		Реализация.Записать(РежимЗаписиДокумента.Проведение);	
		ДлительныеОперации.СообщитьПрогресс(Формат(Счетчик/Всего*100, "ЧДЦ=2;"));
		Счетчик = Счетчик + 1;	
	КонецЦикла;
	
	Возврат Новых; 
	
КонецФункции

Функция СобратьРеализации(Период) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ЕСТЬNULL(ВТ.Реализация, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ДоговорыКонтрагентов.Владелец = ВТ.Реализация.Контрагент
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДоговора <= &Период
	|	И ДоговорыКонтрагентов.ВКМ_КонецДоговора >= &Период
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли


