#Если Сервер Тогда

#Область ПрограммныйИнтерфейс

// Создает и заполняет документ РеализацияТоваровУслуг
//
// Параметры:
//   МассивДоговоров - Массив из СправочникСсылка.ДоговорыКонтрагентов - Массив договоров для создания документов.
//   Период - Дата - дата создания документов.
//
// Возвращаемое значение:
//   Число - количество обработанных договоров.
Функция СоздатьРеализацииВдолгую(МассивДоговоров, Период) Экспорт
	
	РеквизитыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивДоговоров, "Организация, Владелец");
	
	Всего = МассивДоговоров.Количество();
	Счетчик = 0;
	
	Для Каждого Договор Из МассивДоговоров Цикл
		Реквизит = РеквизитыДоговоров.Получить(Договор);
		НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НоваяРеализация.Дата = Период;
		НоваяРеализация.Организация = Реквизит.Организация;
		НоваяРеализация.Контрагент = Реквизит.Владелец;
		НоваяРеализация.Договор = Договор;
		НоваяРеализация.Заполнить(НоваяРеализация);
		НоваяРеализация.Записать();	
		ДлительныеОперации.СообщитьПрогресс(Формат(Счетчик/Всего*100, "ЧДЦ=2;"));	
		Счетчик = Счетчик + 1;	
	КонецЦикла;
	
	Возврат Счетчик; 
	
КонецФункции

#КонецОбласти

#КонецЕсли


