#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКДанным = Параметры.ПутьКДанным;
	ДанныеДляАнализа = ПолучитьИзВременногоХранилища(ПутьКДанным);
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
	Для Каждого ТабСтр Из ДанныеДляАнализа Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(ТабСтр.Сотрудник);
		Точка.Текст = ТабСтр.Наименование;
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		ЗначениеДГ = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = ЗначениеДГ.Добавить();
		Интервал.Начало = ТабСтр.ДатаНачала;
		Интервал.Конец = КонецДня(ТабСтр.ДатаОкончания);
	КонецЦикла;

	УдалитьИзВременногоХранилища(ПутьКДанным);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти
