#Область ОбработчикиСобытийЭлементовТаблицыФормыЗарплатаСотрудников

&НаКлиенте
Процедура ЗарплатаСотрудниковПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗарплатаСотрудников.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Сотрудник) Тогда
		Возврат
	КонецЕсли;
	Если ТекДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные") Тогда
		Возврат	
	КонецЕсли;
	Если ТекДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад") Тогда
		Размер = ЗапроситьОклад(ТекДанные.Сотрудник);	
	КонецЕсли;
	Если Размер = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет данных по окладу сотрудника!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Если ТекДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Процент") Тогда
		Размер = ЗапроситьПроцент(ТекДанные.Сотрудник);	
	КонецЕсли;

	ТекДанные.Размер = Размер;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗапроситьОклад(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Оклад
	Иначе
		Возврат 0
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗапроситьПроцент(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток, 0) КАК Процент
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(&Период, Сотрудник = &Сотрудник) КАК
		|		ВКМ_ВыполненныеСотрудникомРаботыОстатки";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Процент
	Иначе
		Возврат 0
	КонецЕсли;
		
КонецФункции

//&НаСервере
//Функция ЗаполнитьНаСервере(Сотрудник)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
//		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток, 0) КАК ПроцентКОплате
//		|ИЗ
//		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
//		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(&Период, Сотрудник = &Сотрудник) КАК
//		|			ВКМ_ВыполненныеСотрудникомРаботыОстатки
//		|		ПО ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
//	Запрос.УстановитьПараметр("Период", Объект.Дата);
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	Результат = Новый Структура;
//	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
//		Результат.Вставить(Колонка.Имя);
//	КонецЦикла;
//	
//	Выборка = РезультатЗапроса.Выбрать();
//	Выборка.Следующий();
//	
//	ЗаполнитьЗначенияСвойств(Результат, Выборка);
//	
//	Возврат Результат;
//	
//КонецФункции

#КонецОбласти