#Область ОбработчикиСобытийЭлементовТаблицыФормыЗарплатаСотрудников

&НаКлиенте
Процедура ЗарплатаСотрудниковПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЗарплатаСотрудников.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Сотрудник) Или 
			ТекДанные.ВидРасчета <> ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад") Тогда
		Возврат
	КонецЕсли;
	КОплате = ЗаполнитьНаСервере(ТекДанные.Сотрудник);
	
	Если КОплате = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет данных по окладу сотрудника!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТекДанные.ДатаНачала = НачалоМесяца(Объект.Дата);
	ТекДанные.ДатаОкончания = КонецМесяца(Объект.Дата);
	ТекДанные.Размер = КОплате.Оклад;
	ТекДанные.ПроцентОтРабот = КОплате.ПроцентКОплате;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток, 0) КАК ПроцентКОплате
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(&Период, Сотрудник = &Сотрудник) КАК
		|			ВКМ_ВыполненныеСотрудникомРаботыОстатки
		|		ПО ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти