#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Набор = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей();
	ЧислоСекундВСутках = 86400;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Дат = Строка.ДатаНачала;
		Пока Дат <= Строка.ДатаОкончания Цикл
			Запись = Набор.Добавить();
			Запись.Сотрудник = Строка.Сотрудник;
			Запись.Дата = Дат;
			Запись.Значение = 1;
			Дат = Дат + ЧислоСекундВСутках; 
		КонецЦикла;
		Набор.Записать();		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли