
#Область ОбработчикиСобытийФормы
// Код процедур и функций

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьВидимость()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ИзменитьВидимость()

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций

&НаКлиенте
Процедура ИзменитьВидимость()
	Видимость = АбонДоговор(Объект.ВидДоговора);
	Элементы.ВКМ_Абонплата.Видимость = Видимость;
	Элементы.ВКМ_НачалоДоговора.Видимость = Видимость;
	Элементы.ВКМ_КонецДоговора.Видимость = Видимость;
	Элементы.ВКМ_Почасовка.Видимость = Видимость;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АбонДоговор(ВидДог)
	//Если Не ЗначениеЗаполнено(ВидДог)
	Возврат ЗначениеЗаполнено(ВидДог) И ВидДог = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание
КонецФункции
#КонецОбласти

