#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	ЗаполнитьТЧ(Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТЧ(Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТЧ(НаДату)
	
	Если Объект.Проведен Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("Период", КонецДня(НаДату));
	Выборка = Запрос.Выполнить().Выбрать();
	Объект.Выплаты.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.Выплаты.Добавить();
		Строкатч.Сотрудник = Выборка.Сотрудник;
		Строкатч.Сумма = Выборка.СуммаОстаток
	КонецЦикла;

КонецПроцедуры

#КонецОбласти