#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаУсловияОплаты из УсловияОплаты Цикл
		Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаУсловияОплаты.Сотрудник;
		Движение.Оклад = ТекСтрокаУсловияОплаты.Оклад;
		Движение.ПроцентОтРабот = ТекСтрокаУсловияОплаты.ПроцентОтРабот / 100;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли