#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
	ЗаполнитьНаСервере(Объект.Период);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПеречитатьТЗ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо выбрать период!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	МассивДоговоров = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Объект.СписокДог Цикл
		Если СтрокаТЧ.Реализация = ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка") Тогда 
			МассивДоговоров.Добавить(СтрокаТЧ.Договор);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДоговоров.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	РезультатОперации = СоздатьРеализацииНаСервере(МассивДоговоров, Объект.Период);
	
	Если РезультатОперации.Статус = "Ошибка" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатОперации.ПодробноеПредставлениеОшибки;
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатОперации, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ПеречитатьТЗ();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДопПараметры) Экспорт
	Если Результат.Статус = "Выполнено" Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Количество созданных документов - %1.", 
				ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		Сообщение.Сообщить();
		ПеречитатьТЗ();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьРеализацииНаСервере(МассивДоговоров, Период)
	РезультатОперации = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
			"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьРеализацииВдолгую", МассивДоговоров, Период);
	Возврат РезультатОперации;
КонецФункции

&НаКлиенте
Процедура ПеречитатьТЗ()
	Объект.СписокДог.Очистить();
	ЗаполнитьНаСервере(Объект.Период);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ЕСТЬNULL(ВТ.Реализация, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ДоговорыКонтрагентов.Владелец = ВТ.Реализация.Контрагент
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДоговора <= &Период
	|	И ДоговорыКонтрагентов.ВКМ_КонецДоговора >= &Период
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.СписокДог.Добавить();
		СтрокаТЧ.Договор = Выборка.Договор;
		СтрокаТЧ.Реализация = Выборка.Реализация;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
