#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПеречитатьТЗ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо выбрать период!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.СписокДог Цикл
		Если СтрокаТЧ.Реализация = ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка") Тогда 
			СоздатьРеализацию(СтрокаТЧ.Договор);
		КонецЕсли;
	КонецЦикла;
	ПеречитатьТЗ();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьРеализацию(Договор)
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Организация, Владелец, ВКМ_Абонплата");
	НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НоваяРеализация.Дата = Объект.Период;
	НоваяРеализация.Организация = РеквизитыДоговора.Организация;
	НоваяРеализация.Контрагент = РеквизитыДоговора.Владелец;
	НоваяРеализация.Договор = Договор;
	НоваяРеализация.Заполнить(НоваяРеализация);
	НоваяРеализация.Записать();	
//	НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьТЗ()
	Объект.СписокДог.Очистить();
	ЗаполнитьНаСервере(Объект.Период);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ЕСТЬNULL(ВТ.Реализация, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО ДоговорыКонтрагентов.Владелец = ВТ.Реализация.Контрагент
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДоговора <= &Период
	|	И ДоговорыКонтрагентов.ВКМ_КонецДоговора >= &Период
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.СписокДог.Добавить();
		СтрокаТЧ.Договор = Выборка.Договор;
		СтрокаТЧ.Реализация = Выборка.Реализация;
	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры


#КонецОбласти
