#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
	ЗаполнитьНаСервере(Объект.Период);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПеречитатьТЗ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДог

&НаКлиенте
Процедура СписокДогВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	АктивСтрока = Элемент.ТекущиеДанные;
	ПоказатьЗначение(, АктивСтрока.Реализация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо выбрать период!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	РезультатОперации = СоздатьРеализацииНаСервере(Объект.Период);
	
	Если РезультатОперации.Статус = "Ошибка" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатОперации.ПодробноеПредставлениеОшибки;
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатОперации, ОповещениеОЗавершении, ПараметрыОжидания);
		
	ПеречитатьТЗ();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДопПараметры) Экспорт
	Если Результат.Статус = "Выполнено" Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Количество созданных документов - %1.", 
				ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		Сообщение.Сообщить();
		ПеречитатьТЗ();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьРеализацииНаСервере(Период)
	РезультатОперации = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
			"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьРеализацииВдолгую", Период);
	Возврат РезультатОперации;
КонецФункции

&НаКлиенте
Процедура ПеречитатьТЗ()
	Объект.СписокДог.Очистить();
	ЗаполнитьНаСервере(Объект.Период);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Период)

	Выборка = Обработки.ВКМ_МассовоеСозданиеАктов.СобратьРеализации(Период);
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.СписокДог.Добавить();
		СтрокаТЧ.Договор = Выборка.Договор;
		СтрокаТЧ.Реализация = Выборка.Реализация;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
